In [ ]:
# 데이터프레임 행, 열(row, column) 선택 및 필터하기

In [1]:
import pandas as pd

In [7]:
friend_list = [
    ['name', ['john', 'jenny', 'Nate']],
    ['age', [20,30,30]],
    ['job', ['student', 'developer', 'teacher']]
]
df = pd.DataFrame.from_items(friend_list)

C:\Users\user\Anaconda3\lib\site-packages\ipykernel_launcher.py:6: FutureWarning: from_items is deprecated. Please use DataFrame.from_dict(dict(items), ...) instead. DataFrame.from_dict(OrderedDict(items)) may be used to preserve the key order.

In [5]:
df

    name  age        job
0   john   20    student
1  jenny   30  developer
2   Nate   30    teacher

In [ ]:
# 리스트 슬라이싱

In [11]:
df[1:3]

    name  age        job
1  jenny   30  developer
2   Nate   30    teacher

In [ ]:
# loc():원하는 row(행)의 정보를 뽑을 수 있다.

In [8]:
df.loc[[0,2]]

   name  age      job
0  john   20  student
2  Nate   30  teacher

In [9]:
# iloc():원하는 columns(렬)의 정보를 뽑을 수 있다.

In [11]:
df.iloc[[0,2]]

   name  age      job
0  john   20  student
2  Nate   30  teacher

by column condition

In [12]:
df[df.age > 25]

    name  age        job
1  jenny   30  developer
2   Nate   30    teacher

In [13]:
df.query('age>25')

    name  age        job
1  jenny   30  developer
2   Nate   30    teacher

In [13]:
df[ (df.age>25) & (df.name == 'Nate')]

   name  age      job
2  Nate   30  teacher

### filter column

### by index

In [14]:
friend_list = [
    ['john', 20, 'student'],
    ['jenny', 30, 'developer'],
    ['Nate', 30, 'teacher'],
]
df = pd.DataFrame.from_records(friend_list)

In [15]:
df

       0   1          2
0   john  20    student
1  jenny  30  developer
2   Nate  30    teacher

In [17]:
df.iloc[:,0:2] #row의 자료를 전부 가져오고, column은 [0:2]까지의 자료만 가져오라는 뜻

       0   1
0   john  20
1  jenny  30
2   Nate  30

In [18]:
df.iloc[0:2,0:2]

       0   1
0   john  20
1  jenny  30

### by column name

In [20]:
df = pd.read_csv('./friend_list_no_head.csv', header = None, names=['name', 'age', 'job'])

In [21]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [22]:
# filter(): 좀 더 효율적으로 자료를 filter를 할 수 있다.

In [23]:
df_filtered = df[['name', 'age']]

In [24]:
df_filtered

    name  age
0   John   20
1  Jenny   30
2   Nate   30
3  Julia   40
4  Brian   45
5  Chris   25

In [25]:
df.filter(items=['age', 'job'])

   age        job
0   20    student
1   30  developer
2   30    teacher
3   40    dentist
4   45    manager
5   25     intern

In [26]:
df.filter(like='a', axis=1) #column이름에 'a'가 들어있는 자료만 가져온다

    name  age
0   John   20
1  Jenny   30
2   Nate   30
3  Julia   40
4  Brian   45
5  Chris   25

In [30]:
df.filter(like='b', axis=1)

         job
0    student
1  developer
2    teacher
3    dentist
4    manager
5     intern

In [32]:
df.filter(regex='b$', axis=1)

         job
0    student
1  developer
2    teacher
3    dentist
4    manager
5     intern